In [1]:
import pandas as pd

In [4]:
df = pd.read_csv("Top 2000 Universities of the World - Sheet1.csv")

In [5]:
df

,World Rank,Institution,Country,National Rank,Quality of Education Rank,Alumni Employment Rank,Quality of Faculty Rank,Research Performance Rank,Score
0,1,Harvard University,USA,1,1,1,1,1,100.0
1,2,Massachusetts Institute of Technology,USA,2,4,12,2,8,96.7
2,3,Stanford University,USA,3,10,4,3,2,95.1
3,4,University of Cambridge,United Kingdom,1,3,25,4,10,94.1
4,5,University of Oxford,United Kingdom,2,7,27,9,4,93.3
...,...,...,...,...,...,...,...,...,...
1995,1996,Santa Catarina State University,Brazil,56,-,936,-,1938,65.8
1996,1997,Yancheng Institute of Technology,China,275,-,-,-,1920,65.7
1997,1998,Xi'an University of Science and Technology,China,276,-,994,-,1937,65.7
1998,1999,CEU San Pablo University,Spain,53,-,568,-,1992,65.7
1999,2000,Huzhou University,China,277,-,-,-,1922,65.7

In [6]:
df.dtypes

World Rank                     int64
Institution                   object
Country                       object
National Rank                  int64
Quality of Education Rank     object
Alumni Employment Rank        object
Quality of Faculty Rank       object
Research Performance Rank     object
Score                        float64
dtype: object

In [7]:
totalRecord = len(df)
namaAttribute = df.columns
jumlahObjek = len(df.select_dtypes(include=['object']).columns)
jumlahAngka = len(df.select_dtypes(include=['int64', 'float64']).columns)
jumlahNULL = len(df.columns[df.isna().sum() > 0])

dictionary_no1 = {
    "total record": totalRecord,
    "Nama Attribute yang ada": namaAttribute,
    "Jumlah Objek": jumlahObjek,
    "Jumlah Angka": jumlahAngka,
    "Jumlah NULL": jumlahNULL,
}

pd.Series(dictionary_no1)

total record                                                            2000
Nama Attribute yang ada    Index(['World Rank', 'Institution', 'Country',...
Jumlah Objek                                                               6
Jumlah Angka                                                               3
Jumlah NULL                                                                0
dtype: object

In [8]:
df.select_dtypes(include=['int64', 'float64']).mean()

World Rank       1000.50000
National Rank      67.52300
Score              71.58645
dtype: float64

In [9]:
df.select_dtypes(include=['int64', 'float64']).min()

World Rank        1.0
National Rank     1.0
Score            65.7
dtype: float64

In [10]:
df.select_dtypes(include=['int64', 'float64']).max()

World Rank       2000.0
National Rank     347.0
Score             100.0
dtype: float64

In [11]:
df.select_dtypes(include=['int64', 'float64']).quantile([0.25,0.5,0.75])

      World Rank  National Rank  Score
0.25      500.75           10.0   67.7
0.50     1000.50           33.0   70.2
0.75     1500.25           86.0   74.1

In [12]:
df.describe()

        World Rank  National Rank        Score
count  2000.000000    2000.000000  2000.000000
mean   1000.500000      67.523000    71.586450
std     577.494589      83.128615     5.079795
min       1.000000       1.000000    65.700000
25%     500.750000      10.000000    67.700000
50%    1000.500000      33.000000    70.200000
75%    1500.250000      86.000000    74.100000
max    2000.000000     347.000000   100.000000

In [13]:
df.select_dtypes(include=['int64', 'float64']).corr()

               World Rank  National Rank     Score
World Rank        1.00000       0.344200 -0.916950
National Rank     0.34420       1.000000 -0.329112
Score            -0.91695      -0.329112  1.000000

In [26]:
df["World Rank"] = df["World Rank"].astype('int64', errors='ignore')
df["World Rank"].dtypes

dtype('int64')

In [32]:
df.select_dtypes(include=['int64', 'float64']).head(10)

   World Rank  National Rank  Score
0           1              1  100.0
1           2              2   96.7
2           3              3   95.1
3           4              1   94.1
4           5              2   93.3
5           6              4   92.6
6           7              5   92.0
7           8              6   91.5
8           9              7   91.1
9          10              8   90.7

In [33]:
df.select_dtypes(include=['int64', 'float64']).to_csv("Atribut_Bertipe Angka_Yu-Gi-Oh!.csv", index=False)